关于追踪和混淆

这是我的收藏夹，也许我有时候喜欢自言自语,,，，，，，，，，，，，，，，，当然，如果你对这些想法感兴趣，欢迎看看

如果使用的是实名制isp提供的sim，一旦开启移动上网，运营商系统会记录并关联手机的imei/imsi，签约归属地和当前位置信令，
建立一个“设备指纹”但是这个指纹不是建立在标准的tcp,udp,quic之上，至于会记录在哪，我找不到准确答案，也许在基站信令日志里，
这就让人产生一种想在网络世界中打造完美的匿名想法


<img src="https://admin.zephyr.qzz.io/images/4ccf60106a08d83986e859757e6b07f9fe3e04ca.jpg" width="500" alt="IMAGE 2026-05-25 21:48:54.jpg">


没有任何方案能做到百分百做到匿名，目标是大幅提高攻击成本，让对手觉得不值得或难以长期追踪。追踪混淆时刻在发生，追踪手段有很多，先讲应用层追踪，
imei手机的唯一硬件id和imsi/sim卡的唯一识别码。在手机app里（尤其是国内生态），某些大厂的sdk会互相唤醒。只要有一个app拿到了你的imei/imsi并和你的实名手机号绑定，
其他app通过读取本地存储，甚至利用局域网本地发现协议（如mdns/ssdp，大部份国产机，水果就做的很好，堵死这条路），登录账户，广告id与sdk联盟，路由器数据，云端关联，尝试跨app、跨设备尝试把家里大部份智能设备关联
，还有各种手段4g的smlc和5g的lmf就不一一展开，普通网民上个网不是犯什么滔天大罪用不上，虽说看起来密不透风，但是还是可以找到很多提高成本的方法，互联网设计的底层目的是可达性。
拿蓝星全球互联网架构简单讲，每个国家有多个isp(中国的电信，移动)和公网ip段,as号，书里介绍是向全球顶层IANA申请获得，通过bgp(边界网关协议)路由宣告ip段，各个国家的isp处理国际出口的流量会经过ixp(国际互联网交换中心)或者其他的同样的东西进行多边数据交换
，就是网络主权管辖与流量深度审计(dpi)的核心边界，跨国流量的递送必须依赖bgp路由在各主权国家级isp之间进行的路由通告与最优路径选择,大型互联网公司可以和对等网络公司进行免费交换流量。
这里问题就来了，一旦进入其它isp的路由设施，本地的isp有效追踪手段大幅减低，但是事前和事后能力依然在，注意，这里是追踪！在tls/https普及后，isp通常无法直接读取应用层明文内容，但仍可观察元数据，
例如目标ip,sni(部分场景),流量模式,时序,数据量等，要解决先前追踪问题，就得在加入网络开始，既然无线移动网络接入行不通，还有最简单的蹭网，对！像很多餐饮，咖啡店和生意有关的大部份会提供一些免费没认证的wifi，
基于ieee规定的802.11相比蜂窝实名网络，开放wifi的身份绑定能力更弱，无线局域网运作我大致分(这里简单理解，最好以ieee为准！)成两层，第一层物理层：无线电波的工作频段（如2.4ghz,5ghz,6ghz）,
调制方式正交频分复用(ofdm)，这个为了不误导和严谨，想了解的请看上面的书，[简单了解点我](https://en.wikipedia.org/wiki/Orthogonal_frequency-division_multiplexing)。
第二是mac层规定，这里主要是接入机制和防止多台设备同时发送帧导致信号碰撞，帧格式也是在这一层规定的，mac帧包括头部,负载，fcs(帧校验序列),管理帧,控制帧（ack rts/cts）。大致这些，这里有个有趣的是最早版本到如今的wifi6(802.11ax)，
所有版本的协议在理论上全都受到fragattacks攻击,802.11a,802.11g版本因没有严格管控控制针导致外界通过伪造deauth帧将用户下线了，又因为会自连接，通过鲨鱼鳍抓取握手包进行暴力破解，其实只要密码难度高，攻击者只是在做白用功，但是未加密的管理帧也暴露许多弱点，
Deauth攻击还有dhcp泛洪，刷满ip池。是的！大致就是这些(抛开算法和ap，交换机这些东西来讲)，没怎么看到有什么强制绑定的能力<details><summary><b>不过在特定区域也是有手段追踪的（点击展开）</b></summary>1.MAC tracking2.Probe request fingerprinting3.RSSI
triangulation4.Sequence number correlation5.Association timing6.WPA enterprise logs7.Captive portal8.Device fingerprinting
</details>，只是餐饮和奶茶开放网络都是基于家庭形式，如果硬扯mac追踪，嗯，是，mac是可以改的，改成66:66:66:66:66:66都可以，即使mac随机化,很多设备仍会泄漏:支持速率,vendor ie,ht/vht capability,probe行为,这些也能形成无线指纹，苹果后来专门修这个。
至于怎么连网，当然不是蹭网大师，高增益天线！大致可连接方圆五百米射程内的免费wifi，手动能力强的可以手搓，也可以咸鱼购买。这样确实可以规避了基于蜂窝接入层的实名关联，还可以购买全新或者二手设备，树莓派，路由器，随身wifi只要能刷入Linux就行，彻底解决历史关联问题。

<img src="https://admin.zephyr.qzz.io/images/21a71684dd068a6cb6e1f8c912957a1683fad4b8.jpg" width="500" alt="IMAGE 2026-05-25 21:48:54.jpg">

接下来是建立在多个层的追踪架构.传输,应用会话层的cookie,localstorage,hsts,supercookie,WebgL,canvas,audiocontext,WebRTC泄漏,ntp泄漏,tls/js3指纹,等...,除了cookie,hsts,tls/js3指纹这些发生在http握手或网络传输阶段，
其它大部份禁用js即可解决，不过会导致大部份网站无法正常访问，js作者Brendan Eich也是踏上漫长的救赎之路([关于Brendan Eich](https://en.wikipedia.org/wiki/Brendan_Eich)),常见的vl..s, Hys..ria ,tr..an,ssr是无法防止追踪的，存在是为突破封锁而生，isp还是可以追踪移动端到代理服务端的五元组,tcp/udp,tls握手,流量大小,JA3/指纹,dns(若未doh/dot),
至于下一跳目标网站归属isp是很难追踪的，大部份人到这里基本就满足了，甚至不用什么高增益天线，毕竟下载bt,查资料,维护远程仓库,看电视剧,或者跨境电商等。但是对于高要求匿名的人，也许tor,i2p可以满足大部份要求，这种网络本质是通过多节点跳转，每个节点只知道要转发给谁，但不知道初始谁发起，目标谁请求，但是对于封锁严格的区域，o..s4，sno...ake，m..k这些网桥流量会被识别阻断，
常见是使用vl..s进行突破封锁，应用层或浏览器层漏洞可能绕过匿名网络，直接建立真实网络连接，Whonix就是为应对这种情况而生，Whonix会把系统拆成Whonix gateway和Whonix workstation，可以说Gateway负责联网，运行tor/i2p，Workstation跑浏览器/应用，不能直接联网要交给Gateway，这样解决了主机因漏洞位置暴露问题，对于高敏人群，还会在whonix前配合qubesos，大量使用多隔离环境，每个环境有不同的cookie，hsts，localstorage大大增加追踪难度，每次做敏感事都新建一个，完后销毁。
对于canvas，webgl，浏览器指纹问题，可以使用torbrowser来进一步隐藏，要注意torbrowser并不依赖大量随机化，而是是用统一化策略，即通过防止指纹残留(rfp)机制减少不同用户之间的环境差异，例如统一 user.agent、字体行为、时区与部分图形接口特征，以降低基于canvas、webgl与js的设备指纹识别能力!这本身已经是具备高威胁模型了，为什么要如此大费周章让数据包绕地球一圈来访问目标服务器，这是因为群体目标不同带来的疑惑，一台具备高匿名的计算机是和生活机分开的，生活中的社交媒体账号邮箱都会暴露使用者身份，
一个高敏团队在面对国家级力量介入时，不断提高追踪成本是必要的，毕竟对方手握多个未公开oday，在长期监控下发动链式,水坑,捕鲸等攻击是有必要防止的，这套做法对大多数人来说可能显得过于复杂，但对于那些传播蠕虫，勒索病毒甚至是近期兴起的供应链投毒团队是所需的，相比之下，常见的灰产(如代理,api中转,自动发卡,聚合支付等)在防御投入上则相形见绌。目前，灰产从业者普遍采用指纹浏览器加三重链式代理或单台跳板服务器模式。
事前是有的，只是削弱事后的联系！这两种模式在国家级追踪模型面前有点形同虚设，他们只是在一定程度上增加侦查成本。
在资金链上灰产已广泛绑定web3、利用第三方收款转化为加密货币，极大地增加了资金溯源的复杂度，但这并非万无一失，第三方资金是无法保证无风险的。由于灰产通常属于低价值目标，在面对这类群体时往往采用“杀一儆百”的方式制裁。

还有些较特殊，拿ssh举例，这个个运行在tcp上远程维护服务器的协议，没有渲染引擎和js，但不等于无法追踪，毕竟ssh依赖tcp会使用到五元组，并且在完成三次握手后会进行密钥协商[Doggie-Hellman](https://en.wikipedia.org/wiki/Diffie–Hellman_key_exchange),这里会泄漏hasssh指纹，如果强行将ssh流量注入到tor还是泄漏hasssh，因为tor的出口向明网后tor的加密会被剥离，此时发送的是最原始的ssh流量，要解决关联可以在讲ssh注入tor时在前套一层v2..y，这类工具会在数据包随机填充并打乱发送时间，降低ssh特有的数据包大小和行为特征
